app/controllers/guests_controller.rb

  def login
    guest = Guest.all.destroy_all
    guest = Guest.new(content: "ゲストログインしました")
    guest.save
---
DELETE FROM "guests" WHERE "guests"."id" = ?  [["id", 16]]
SELECT "guests".* FROM "guests"
INSERT INTO "guests" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "ゲストログインしました"], ["created_at", "2020-03-22 06:06:08.726968"], ["updated_at", "2020-03-22 06:06:08.726968"]]

  def show
    @post = Guest.find_by(id: params[:id])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]

  def update
    post = Guest.find_by(id: params[:id])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def destroy
    post = Guest.find_by(id: params[:id])
    post.destroy
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
DELETE FROM "guests" WHERE "guests"."id" = ?  [["id", 35]]