app/controllers/posts_controller.rb

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 11]]
---
  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy