app/controllers/posts_controller.rb

  def index
    @posts = Post.where(user_id: session[:user_id]).order(created_at: :desc)
    @guest_content = Guest.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
SELECT "guests".* FROM "guests"

  def create
    if session[:name] == "guest"
      @post = Guest.new(content: params[:name])
      @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "テスト"], ["created_at", "2020-03-19 13:22:03.518935"], ["updated_at", "2020-03-19 13:22:03.518935"], ["user_id", 1]]
INSERT INTO "guests" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "テスト"], ["created_at", "2020-03-26 05:20:20.728057"], ["updated_at", "2020-03-26 05:20:20.728057"]]

  def show
    if session[:name] == "guest"
      @post = Guest.find_by(id: params[:id])
    else
      @post = Post.find_by(id: params[:id])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def update
    if session[:name] == "guest"
      @post = Guest.find_by(id: params[:id])
      @post.content = params[:content]
      @post.save
      redirect_to("/posts/index")
    else
      @post = Post.find_by(id: params[:id])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "guests" SET "content" = ?, "updated_at" = ? WHERE "guests"."id" = ?  [["content", "ゲストログイン"], ["updated_at", "2020-03-26 05:14:14.313710"], ["id", 24]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "変更２"], ["updated_at", "2020-03-26 05:14:35.814763"], ["id", 18]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]