app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["name", "yoko2"], ["email", "yoko.com"], ["created_at", "2020-03-20 00:59:20.005332"], ["updated_at", "2020-03-20 00:59:20.005332"], ["password", 45]]
---
  def signup
    if User.find_by(name: params[:name])
      flash[:notice] = "このIDはすでに使われています"
      redirect_to("/")
    elsif User.find_by(email: params[:email])
      flash[:notice] = "このメールアドレスは既に登録されています"
      redirect_to("/")
    else
      flash[:notice] = "新規登録しました"
      session[:user_id] = params[:id]
      session[:name] = params[:name]
      @user = User.new(
        name: params[:name],
        email: params[:email],
        password: params[:password]
      )
      @user.save

SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ? LIMIT ?  [["name", "yoko2"], ["password", 45], ["LIMIT", 1]]
---
  def signin
    @user = User.find_by(
      name: params[:name],
      password: params[:password]
    )